{
  "image0": {
    "name": "pca_projection_plot_6_20250527-135752.png",
    "caption": "Scatter plots of the first two principal components of the engineered features, colored by $\\Omega_m$ (left) and $\\sigma_8$ (right). There is no clear visual separation between different values of the cosmological parameters.\n\\"
  },
  "image1": {
    "name": "engineered_feature_dist_diff_max_4_20250527-135752.png",
    "caption": "Distributions of the max-pooled diffusion map embeddings, showing the feature distributions after mean imputation of NaN values resulting from computational constraints for large graphs. These features did not prove effective in predicting cosmological parameters.\n\\"
  },
  "image2": {
    "name": "engineered_feature_dist_laplacian_2_20250527-135752.png",
    "caption": "Distributions of Laplacian spectral features (mean, standard deviation, skewness, kurtosis, and sum of the 10 smallest non-zero eigenvalues) across the training set merger trees. These features, intended to capture graph structure, were ultimately found to be poor predictors of cosmological parameters, likely due to the imputation of NaN values arising from computational limitations for large graphs."
  },
  "image3": {
    "name": "feature_importances_sigma_8_8_20250527-135752.png",
    "caption": "Feature importances for predicting $\\sigma_8$ using Random Forest Regressor (RFR) and Gradient Boosting Regressor (GBR) models, based on PCA-transformed engineered features and baseline aggregated node features. The baseline models highlight the importance of mean scale factor, mass, and concentration, while PCA-transformed features show varied importances across principal components, but ultimately lead to poor predictive performance."
  },
  "image4": {
    "name": "feature_importances_Omega_m_7_20250527-135752.png",
    "caption": "Feature importances for predicting $\\Omega_m$ using Random Forest Regressor (RFR) and Gradient Boosting Regressor (GBR) models, trained on PCA-transformed engineered features and baseline aggregated node features. The baseline models show that average halo properties such as concentration and Vmax are important predictors, whereas the engineered features show no clear importance."
  },
  "image5": {
    "name": "model_performance_r2_11_20250527-135752.png",
    "caption": "Comparison of R-squared (R²) scores for predicting $\\Omega_m$ and $\\sigma_8$ using different feature sets and models. The GCN and baseline aggregated node features outperform engineered features with PCA, which show negative R² values, indicating poor performance.\n\\"
  },
  "image6": {
    "name": "engineered_feature_dist_edge_1_20250527-135752.png",
    "caption": "Distributions of edge features (mean and variance of the absolute difference in scale factors between connected nodes, and mean and variance of the log-ratio of descendant mass to progenitor mass). These relatively compact distributions were used to predict cosmological parameters, but ultimately performed worse than simpler features."
  }
}