{
  "image0": {
    "name": "persistence_diagram_1_1748137556.png",
    "caption": "Persistence diagram (H0) for a sample merger tree, plotting the birth and death times (scale factors) of connected components. The absence of Topological Data Analysis in this study meant that features extracted from such diagrams could not be used to inform the GNN or correlate with the assembly bias proxy.\n\\"
  },
  "image1": {
    "name": "persistence_diagram_tree0_20250524214205.png",
    "caption": "Persistence diagrams for a sample merger tree, displaying the birth and death scale factors of topological features (connected components in H0 and loops in H1). The H1 diagram is empty, and since Topological Data Analysis was not performed, these diagrams could not inform the GNN."
  },
  "image2": {
    "name": "tda_feature_correlation_heatmap_3_1748137556.png",
    "caption": "Correlation heatmap between topological features derived from merger trees and the assembly bias proxy. The lack of strong correlations may explain the limited success of the GNN in predicting the assembly bias proxy.\n\\"
  },
  "image3": {
    "name": "predicted_vs_true_bias_plot_2_1748137938.png",
    "caption": "Scatter plot of the GNN's predicted assembly bias proxy values against the true values for the test set. The points are scattered far from the ideal y=x line (red dashed line), indicating a poor predictive performance, as reflected by the high Mean Squared Error (MSE) and the large negative R-squared (R²)\\ensuremath{\\_}value.\n\\"
  },
  "image4": {
    "name": "avg_betti_curves_2_1748137556.png",
    "caption": "Average Betti numbers (H0 and H1) as a function of normalized scale factor, averaged over the training set merger trees. The Topological Data Analysis, which would have used these features, was not executed in this study."
  },
  "image5": {
    "name": "training_validation_loss_curves_plot_1_1748137938.png",
    "caption": "Training and validation loss curves for the GNN model with 1 GCN layer and 32 hidden channels. The high MSE values indicate the model did not learn the relationship between merger tree features and the assembly bias proxy, likely due to the limited dataset size.\n\\"
  }
}