{
  "image0": {
    "name": "pred_vs_true_qtt_k2_r2_10_20250524-175150.png",
    "caption": "Scatter plot of predicted versus true values for final halo mass using a Random Forest Regressor trained on QTT features (k=2, rank=2). The limited number of data points (N=5) highlights the challenge of generalizing the observed performance.\n\\"
  },
  "image1": {
    "name": "feature_importances_qtt_k2_r2_12_20250524-175150.png",
    "caption": "Feature importances for the QTT-based model with k=2 and rank=2. The plot shows the relative importance of each QTT feature in the Random Forest Regressor, highlighting that different components of the compressed QTT representation contribute differently to the prediction task, even though the interpretation of individual QTT feature importances is challenging due to their abstract nature. With a sample size of only N=5, the importances are subject to the specific characteristics of these five samples.\n\\"
  },
  "image2": {
    "name": "feature_dist_baseline_features_1_20250524-175501.png",
    "caption": "Distributions of the first 12 baseline features across the five merger trees, colored by the target halo mass. The variance features are zero for all trees, indicating a lack of variation along the main branch for these samples. The limited number of unique values highlights the small sample size, which limits the generalizability of the regression results."
  },
  "image3": {
    "name": "pred_vs_true_qtt_k2_r3_13_20250524-175150.png",
    "caption": "Scatter plot of predicted vs. true values for final halo mass using a Random Forest Regressor trained on QTT features (k=2, rank=3). The limited number of data points (N=5) highlights the need for a larger dataset to validate the effectiveness of the QTT-based feature engineering approach."
  },
  "image4": {
    "name": "comparison_r2_24_20250524-175150.png",
    "caption": "Comparison of R-squared values for final halo mass prediction using baseline features and QTT-derived features with varying k-hop neighborhood sizes and QTT ranks, demonstrating the relative performance on a dataset of five trees."
  },
  "image5": {
    "name": "pred_vs_true_qtt_k1_r2_4_20250524-175150.png",
    "caption": "Scatter plot of predicted versus true final halo mass values for the QTT (k=1, rank=2) model, demonstrating the in-sample performance on the N=5 dataset. The points represent the model's predictions, and the dashed line indicates perfect prediction."
  }
}